app/Controllers/Auth.php

        }

        $builder = $this->db->table('users');
        $users = $builder->orderBy('created_at', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC