app/Controllers/Auth.php

    public function create()
{
    helper(['form']);
    $users = new UserModel();

    $data = [
        'name'     => $this->request->getPost('name'),
        'email'        => $this->request->getPost('email'),
        'password'     => $this->request->getPost('password'),
        'pass_confirm' => $this->request->getPost('pass_confirm'),
        'role'         => 'user',
    ];

    if (! $users->save($data)) {
---
INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('User2', 'try@gmail.com', '$2y$10$IgoKxfZ5y35SxMiFVKfOM.bnJ.tLXVEu0kQfzpsR8qdteSugIxJGG', 'user', '2025-09-11 00:23:37', '2025-09-11 00:23:37')

     public function auth()
    {
        $session = session();
        $users   = new UserModel();

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $users->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'try@gmail.com'
 LIMIT 1